package 올바른괄호의갯수;

class Solution {
	public int solution(int n) {
		int[] dp = new int[15];
		dp[0] = 1;
		dp[1] = 1;
		dp[2] = 2;
		dp[3] = 5;
		for (int i = 4 ; i <= n ; i++) {
			for (int j = 1 ; j <= i ; j++) {
				dp[i] += dp[j - 1] * dp[i - j];
			}
		}
		return dp[n];
	}
}

public class Main {
	public static void main(String[] args) {
		Solution sol = new Solution();
		System.out.println(sol.solution(4));
	}
}

// 2 = 1 + 11
// 3 = 2 + 111 12 21
// 4 = 5 + 1111 112 121 211 13 31 m31 1m3
// {}                                                                                                   1
// {}{} {{}}                                                                                            2
// {}{}{} {}{{}} {{}}{} {{}{}} {{{}}}                                                                   5
// {}{}{}{} {}{}{{}} {}{{}}{} {}{{}{}} {}{{{}}} {}{{}}{} {{}}{}{} {{}{}}{} {{{}}}{} {{{{}}}} {{}}{{}}   11

// 1
// 1 1
// 2 3
// 5 9
// 14

// {{}}{{}}

//{{{}}}{{}} {{}}{{{}}}  {{}}{}{{}} 

// 2 + 2

// 2 + 3, 3 + 2

// 1 + 2 
// 2 + 1


// 이전 결과를 하나씩 감싸기 (dp[n - 1]) + 이전 결과들의 조합
// dp[3] = 2 * 2 - 1 + 1 * 2 = 5
// dp[4] = 5 * 2 - 1 + 2 * 2 = 9

// 20 + 
// {{{{{}}}}} {}{{{}}}{} {}{}{{{}}} {{{}}}{}{} {}{{{{}}}} {{{{}}}}{} {{{}}}{{}} {{}}{{{}}}